app/controllers/admin/advices_controller.rb

SELECT "advices".* FROM "advices"
---
    def index
      @advices = Advice.all

INSERT INTO "advices" ("title", "description", "country_id", "symptom_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hospital"], ["description", "go straight to hospital"], ["country_id", 1], ["symptom_id", 7]]
---
    def create
      Advice.create(advice_params)

SELECT "symptoms".* FROM "symptoms"
SELECT "countries".* FROM "countries"
SELECT "topics".* FROM "topics"
---
    def new
      @symptoms = Symptom.all
      @countries = Country.all
      @topics = Topic.all

SELECT  "advices".* FROM "advices" WHERE "advices"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "advices" WHERE "advices"."id" = $1  [["id", 3]]
---
    def destroy
      advice = Advice.find(params[:id])
      advice.destroy