app/controllers/admin/countries_controller.rb

INSERT INTO "countries" ("iso", "iso3", "name") VALUES ($1, $2, $3) RETURNING "id"  [["iso", "FR"], ["iso3", "FRN"], ["name", "France"]]
---
    def create
      Country.create(country_params)