app/controllers/admin/symptoms_controller.rb

SELECT  "symptoms".* FROM "symptoms" WHERE "symptoms"."id" = $1 LIMIT 1  [["id", 1]]
---
    def show
      @symptom = Symptom.find(params[:id])

SELECT "symptoms".* FROM "symptoms"
---
    def index
      @symptoms = Symptom.all

INSERT INTO "symptoms" ("title", "description") VALUES ($1, $2) RETURNING "id"  [["title", "Swollen Feet"], ["description", "Swollen Feet"]]
---
    def create
      Symptom.create(symptom_params)

SELECT  "symptoms".* FROM "symptoms" WHERE "symptoms"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "symptoms" WHERE "symptoms"."id" = $1  [["id", 1]]
---
    def destroy
      symptom = Symptom.find(params[:id])
      symptom.destroy