app/controllers/admin/terms_controller.rb

SELECT "terms".* FROM "terms"
---
    def index
      @terms = Term.all

INSERT INTO "terms" ("month", "ante_natal", "post_natal") VALUES ($1, $2, $3) RETURNING "id"  [["month", 4], ["ante_natal", "f"], ["post_natal", "f"]]
---
    def create
      Term.create(term_params)

SELECT  "terms".* FROM "terms" WHERE "terms"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "terms" WHERE "terms"."id" = $1  [["id", 2]]
---
    def destroy
      term = Term.find(params[:id])
      term.destroy