app/controllers/admin/topics_controller.rb

INSERT INTO "topics" ("name", "description") VALUES ($1, $2) RETURNING "id"  [["name", "Emergency Care"], ["description", "How to get emergency care in your current host country"]]
---
    def create
      Topic.create(topic_params)