app/views/admin/advices/new.html.erb

SELECT "countries".* FROM "countries"
---
    <%= f.label :country %><br>
    <%= f.collection_select(:country_id, Country.all, :id, :name) %>

SELECT "symptoms".* FROM "symptoms"
---
    <%= f.label :symptom %><br>
    <%= f.collection_select(:symptom_id, Symptom.all, :id, :title) %>

SELECT "topics".* FROM "topics"
---
    <%= f.label :topic %><br>
    <%= f.collection_select(:topic_id, Topic.all, :id, :name) %>