app/controllers/symptoms_controller.rb

SELECT "symptoms".* FROM "symptoms"
---
  def index
    @symptoms = Symptom.all

SELECT  "symptoms".* FROM "symptoms" WHERE "symptoms"."id" = $1 LIMIT 1  [["id", 7]]
---
  def show
    @symptom = Symptom.find(params[:id])