app/controllers/terms_controller.rb

  def index
    @terms = Term.all
---
SELECT "terms".* FROM "terms"

  def show
    @term = Term.find(params[:id])
---
SELECT  "terms".* FROM "terms" WHERE "terms"."id" = $1 LIMIT 1  [["id", 1]]