app/views/admin/symptoms/new.html.erb

    <%= f.label :term_at_pregnancy %><br>
    <%= f.collection_select(:term_id, Term.all, :id, :month, include_blank: 'Please select part of pregnancy this symptom is related to') %>
---
SELECT "terms".* FROM "terms"